{
    "text": "A number of research papers document that firms increase investments following equity offerings (see, e.g., Kim and Weisbach, 2008, Walker and Yost, 2008). Kim and Weisbach (2008), for example, show that initial public offerings (IPOs) serve to raise capital and finance capital expenditures and research and development (R&D). Furthermore, IPOs facilitate the acquisition activity of newly listed firms. Celikyurt et al. (2010) and Hovakimian and Hutton (2010) provide evidence that IPO firms benefit financially from going public by means of cash raised in the IPO, access to additional public financing sources, and the use of tradable stock as a takeover currency in acquisitions.1 A survey by Brau and Fawcett (2006) reveals that US chief financial officers value the creation of a takeover currency as the most important motive to conduct an IPO. Complementary studies find that public firms further profit from lower borrowing costs vis-à-vis private firms (Brav, 2009, Schenone, 2010, Saunders and Steffen, 2011).\nIn this paper, we expand upon existing studies on the financing role of IPOs by comparing firms from countries with different financial systems. More specifically, we assess whether the positive IPO effect in the context of merger and acquisition (M&A) decisions documented in prior literature is comparable across countries at different stages of stock market development.2\nAs outlined in Allen and Gale (2000), financial systems vary greatly across countries. In bank-centered markets, such as Germany, the financing of corporate investments does not primarily rely on public capital markets. The key characteristic of such financial systems is the provision of external funds for investment needs by banks, and the close link between banks and other corporations. Conversely, in market-based systems, such as the UK, organized financial markets play a more important role in allocating financial resources among firms.3 Moreover, while firms can rely on internal capital markets (e.g. retained earnings), banks, and external public markets for their financing needs, the relative use of these sources differs substantially across countries. Subrahmanyam and Titman (1999) show that financing through financial markets is relatively more beneficial for firms in large and more liquid markets.\nConsidering the differences in financial systems, we hypothesize that financing external investments via IPOs is relatively more common in market-driven economies in comparison to bank-centered economies. If IPOs indeed alleviate financial constraints, we expect acquisition investments of IPO firms in countries with a relatively more developed stock market to be more positively affected by the going public decision.\nTo carry out our analysis, we employ a sample of 900 IPO firms from 16 European countries (i.e., the former EU15 plus Norway) over the period 2002–2014 and an equal number of comparable private firms. We analyze a European sample because Europe harbors both well-developed market-based countries and a number of relatively more bank-focused markets. Europe also provides an ideal testing ground for our hypothesis because, in contrast to other regions, financial data for privately-owned companies are available. To proxy for the degree of stock market development in a given country, we use the aggregate stock market capitalization scaled by the corresponding country GDP (see, e.g., Levine and Zervos, 1998, Hsu et al., 2014). We focus on the acquisition activity of newly listed firms for the following reasons. First, acquisitions require considerable investment resources because they are major corporate finance decisions (see, e.g., Chen et al., 2007). Therefore, possible financing advantages of the going public decision are expected to materialize with respect to acquisitions more than any other corporate investment policy. Second, as a result of going public, acquirers obtain the ability to pay with the stock of their own firms (see, e.g., Brau and Fawcett, 2006, Celikyurt et al., 2010, Hovakimian and Hutton, 2010).\nOur empirical analysis relies on difference-in-difference estimators to examine the effect of going public on the firms’ M&A activity, comparing the behavior of IPO firms relative to a carefully constructed control group of similar firms that remain private. Relying on a triple interaction term, we also assess whether the IPO decision spurs acquisition activity relatively more in countries with high stock market development.\nIn addition to providing evidence of differences between the sources of financing in different financial systems, we also assess whether and how these differences relate to a relief of financial constraints. As a major effect on the firm's performance and growth opportunities, we expect IPO firms from countries with a more developed stock market to increase relatively more in size and in profitability. In this context, we also investigate additional firm outcomes that are potentially affected by financial relief, such as total assets, revenues, and operating performance.\nOur study delivers a number of interesting findings. First, we document that firms conducting an IPO take over more firms in the three years post-IPO as compared to the sample of comparable firms that remain private. Relative to non-IPO firms, the likelihood of undertaking an acquisition increases by about 8.4% on average per year in the post-IPO period for IPO firms. The increase in acquisition activity is statistically and economically significant, and not simply limited to the acquisition likelihood, but also confirmed when we take into account the number of deals undertaken and the amount spent in acquisitions. These results indicate that IPOs provide more financial flexibility in the M&A market for European firms in our sample, a result which is in line with prior literature using US data (see, e.g., Celikyurt et al., 2010, Hovakimian and Hutton, 2010). Second, we document that the degree of stock market development amplifies the positive impact of IPOs on M&A activity. While IPO firms increase their M&A activity vis-à-vis private firms, we uncover a significant impact of stock market development on how IPOs affect the acquisitiveness of the firm. Specifically, relative to private firms and IPO firms from countries with a low degree of stock market development, IPO firms operating in countries with a more developed stock market (i.e., market-based IPO firms) become more acquisitive in the post-IPO period. The economic significance of our results is quite substantial. As an illustration, while the average IPO effect on the likelihood to conduct an acquisition across different financial systems is 8.4%, the average IPO effect in countries with a high stock market development is 12.6%, and only 4.3% in countries with less stock market development.\nTaken collectively, the results highlight the differential role that IPO financing plays and imply that market-based IPO firms are more likely to reduce their financial constraints after going public. These findings are not limited to takeover activity as firm outcome. Firms operating in a market-based economy also experience an increase in total assets and revenues after the IPO, underpinning the economic significance of our results. Additional tests unveil that market-based IPO firms are more likely to benefit from IPOs. We document that market-based IPO firms become more profitable in the post-IPO period, indicating that market-based firms take advantage of going public by extending their investment opportunity set.",
    "terms": [
        "stock market development", "stock market capitalization", "public capital markets", "external public markets", "organized financial markets", "market-based systems", "bank-centered markets", "stock market liquidity", "tradable stock", "stock market resources", "stock market growth", "market-based ipo firms", "stock market maturity", "stock market financing", "stock market role", "stock market performance", "stock market impact", "high stock market development", "low stock market development", "stock market efficiency", "stock market integration", "stock market size", "stock market access", "aggregate stock market value", "stock market expansion", "equity offerings", "public equity markets", "ipo firms (initial public offerings)", "going public", "public financing sources", "ipo effect on stock market", "publicly listed firms", "ipo decision in stock market", "market-based financial system", "market development level", "financial market resources", "stock market proxies", "stock market opportunities", "stock market benchmarks", "stock market dynamics", "ipo impact on market", "stock market data", "stock market indicators", "stock market conditions", "stock market participation", "equity markets", "stock market accessibility", "capital market development", "stock market trends", "public market listings", "market liquidity", "market-based financing", "financial market development", "capital markets", "market performance metrics", "stock market dependence", "market-driven economies", "market-based economy", "financial market access", "market capitalization-to-gdp ratio"
    ]
}